# ManyElementInFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures..::..ManyElementInFamily Property
BuiltInFailures..::..PerformanceFailures Class See Also
---
Family definition contains too many elements. Consider simplification of the family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ManyElementInFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ManyElementInFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ManyElementInFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PerformanceFailures Class
Autodesk.Revit.DB Namespace